Revit 2027 API
RebarSpliceUtils.CanRebarBeSpliced Method
Overload List
Name | Description
CanRebarBeSpliced(Rebar, RebarSpliceOptions, RebarSpliceGeometry) |  Verifies if the rebar can be spliced with the RebarSpliceGeometry.
CanRebarBeSpliced(Rebar, RebarSpliceOptions, Line, ElementId) |  Verifies if the rebar can be spliced with the provided line.
CanRebarBeSpliced(Rebar, RebarSpliceOptions, Line, XYZ) |  Verifies if the rebar can be spliced with the provided line.
Top
See Also
Reference
RebarSpliceUtils Class
Autodesk.Revit.DB.Structure Namespace